# Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in d:\anaconda\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)

In [2]:
# importing library
import pandas as pd
import numpy as np

# Series

In [ ]:
# It is one dimensional labelled array that can hold data of any type

In [3]:
s=pd.Series(np.random.rand(5))
s

0    0.157017
1    0.158952
2    0.237078
3    0.495581
4    0.300669
dtype: float64

In [4]:
#indexing
s[3]

0.4955812154118904

In [5]:
s[4]

0.30066852900786234

In [6]:
#Slicing
s[2:]

2    0.237078
3    0.495581
4    0.300669
dtype: float64

In [7]:
#update the value
s[0]=560

In [8]:
s

0    560.000000
1      0.158952
2      0.237078
3      0.495581
4      0.300669
dtype: float64

In [9]:
s.index=['a','b','c','d','e']
s

a    560.000000
b      0.158952
c      0.237078
d      0.495581
e      0.300669
dtype: float64

In [10]:
s.index=['*','*','*','*','*']

In [11]:
s

*    560.000000
*      0.158952
*      0.237078
*      0.495581
*      0.300669
dtype: float64

In [12]:
s=pd.Series(np.random.rand(5),index=['a','b','c','d','e'])

In [13]:
s

a    0.065365
b    0.069327
c    0.283034
d    0.005025
e    0.055097
dtype: float64

In [14]:
s.argmax()

2

In [15]:
s.argmin()

3

In [16]:
#mean
s.mean()

0.09556964245136963

In [17]:
# Median
s.median()

0.06536474649063373

In [18]:
s.max()

0.2830344425321919

In [19]:
s.min()

0.005025294083596088

In [20]:
arr=np.array([1,2,3,4])

In [21]:
arr

array([1, 2, 3, 4])

In [22]:
arr_series=pd.Series(arr)
arr_series

0    1
1    2
2    3
3    4
dtype: int32

In [23]:
# Using Dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [24]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [25]:
d_series=pd.Series(d)

In [26]:
d_series

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
type(d_series)

pandas.core.series.Series

In [28]:
d_series.drop('a')

b    2
c    3
d    4
dtype: int64

# DataFrame

In [29]:
s1=pd.Series(np.random.rand(5))
s2=pd.Series(np.random.rand(5))

In [30]:
print(s1)
print("----------------")
print(s2)

0    0.402269
1    0.068391
2    0.151010
3    0.316694
4    0.773583
dtype: float64
----------------
0    0.581613
1    0.264860
2    0.978906
3    0.074807
4    0.714459
dtype: float64

In [31]:
# Create Dataframe using Series
a=pd.DataFrame([s1,s2])
a

          0         1         2         3         4
0  0.402269  0.068391  0.151010  0.316694  0.773583
1  0.581613  0.264860  0.978906  0.074807  0.714459

In [32]:
# Creating DataFrame using Dictionary
d={'age':[22,23,24],'salary':[1000,1020,1040]}
d

{'age': [22, 23, 24], 'salary': [1000, 1020, 1040]}

In [34]:
type(d)

dict

In [50]:
#Converting Dictionary to DataFrame
data=pd.DataFrame(d)
data

   age  salary
0   22    1000
1   23    1020
2   24    1040

In [51]:
data['gender']=['Male','Female','Female']
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [37]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['kim',5]]

In [38]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['kim', 5]]

In [41]:
data1=pd.DataFrame(data,columns=['A','B']) # Changing the Column Name
data1

     A    B
0  abc  1.0
1  def  2.0
2  ghi  3.0
3  hij  NaN
4  kim  5.0

In [43]:
data2=pd.DataFrame(data,index=['A','B','C','D','E']) # Changing Index Names
data2

     0    1
A  abc  1.0
B  def  2.0
C  ghi  3.0
D  hij  NaN
E  kim  5.0

In [44]:
marks=[['priya','Maths',90],['Alex','Physics',99]]

In [46]:
d1=pd.DataFrame(marks,columns=['Name','Subject','marks'])

In [47]:
d1

    Name  Subject  marks
0  priya    Maths     90
1   Alex  Physics     99

In [48]:
d1.rename({'marks':'Marks'},axis=1)

    Name  Subject  Marks
0  priya    Maths     90
1   Alex  Physics     99

In [49]:
d1.rename({0:'A',1:'B'},axis=0)

    Name  Subject  marks
A  priya    Maths     90
B   Alex  Physics     99

In [52]:
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [53]:
#iloc and loc Function

In [54]:
data.iloc[2]

age           24
salary      1040
gender    Female
Name: 2, dtype: object

In [55]:
data.loc[2]

age           24
salary      1040
gender    Female
Name: 2, dtype: object

In [57]:
data.iloc[:,2]

0      Male
1    Female
2    Female
Name: gender, dtype: object

In [59]:
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [60]:
data.iloc[0:2 , 1:]

   salary  gender
0    1000    Male
1    1020  Female

In [61]:
data.iloc[1: , 0:2]

   age  salary
1   23    1020
2   24    1040

In [62]:
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [63]:
data.iloc[1: , 1:]

   salary  gender
1    1020  Female
2    1040  Female

In [64]:
data.iloc[:2, :2]

   age  salary
0   22    1000
1   23    1020

In [65]:
# Loc

In [66]:
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [67]:
data.loc[:,['age','gender']]

   age  gender
0   22    Male
1   23  Female
2   24  Female

In [68]:
data.loc[:,['salary']]

   salary
0    1000
1    1020
2    1040

In [69]:
data['salary']

0    1000
1    1020
2    1040
Name: salary, dtype: int64

In [70]:
data.shape

(3, 3)

In [72]:
data.columns

Index(['age', 'salary', 'gender'], dtype='object')

In [76]:
data.dtypes

age        int64
salary     int64
gender    object
dtype: object

In [77]:
data.isnull()

     age  salary  gender
0  False   False   False
1  False   False   False
2  False   False   False

In [78]:
data.isnull().any()

age       False
salary    False
gender    False
dtype: bool

In [79]:
data.isnull().sum()

age       0
salary    0
gender    0
dtype: int64

In [91]:
data2=[['abc',1],['def',2],['ghi',3],['hij'],['kim',5]]

In [92]:
data2

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['kim', 5]]

In [93]:
data3=pd.DataFrame(data2,columns=['A','B'])

In [94]:
data3

     A    B
0  abc  1.0
1  def  2.0
2  ghi  3.0
3  hij  NaN
4  kim  5.0

In [95]:
data3.isnull().any()

A    False
B     True
dtype: bool

In [96]:
data3.isnull().sum()

A    0
B    1
dtype: int64

In [97]:
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040  Female

In [99]:
data.drop(columns=["gender"],axis=1)

   age  salary
0   22    1000
1   23    1020
2   24    1040

In [100]:
# axis=1-----Columns
#axis=0 -----Rows

In [101]:
data.duplicated()

0    False
1    False
2    False
dtype: bool

In [102]:
df=pd.DataFrame({'Bike':['Yamaha','Hero','Pulsor','Hero','Pulsor','Pulsor'],
                 'CC':[150,110,180,110,220,180]})

In [103]:
df

     Bike   CC
0  Yamaha  150
1    Hero  110
2  Pulsor  180
3    Hero  110
4  Pulsor  220
5  Pulsor  180

In [104]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [105]:
df=df.drop_duplicates()

In [106]:
df

     Bike   CC
0  Yamaha  150
1    Hero  110
2  Pulsor  180
4  Pulsor  220

In [107]:
data=pd.read_csv('mtcars.csv')

In [108]:
data

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [109]:
data.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [110]:
data.head(10)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4

In [111]:
data.head(3)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1

In [112]:
data.tail()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.6,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.6,1,1,4,2

In [113]:
data.tail(10)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [114]:
pwd

'D:\\Python'

In [115]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   model   32 non-null     object
 1   mpg     32 non-null     float64
 2   cyl     32 non-null     int64
 3   disp    32 non-null     float64
 4   hp      32 non-null     int64
 5   drat    32 non-null     float64
 6   wt      32 non-null     float64
 7   qsec    32 non-null     float64
 8   vs      32 non-null     int64
 9   am      32 non-null     int64
 10  gear    32 non-null     int64
 11  carb    32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [116]:
data.isnull().sum()

model    0
mpg      0
cyl      0
disp     0
hp       0
drat     0
wt       0
qsec     0
vs       0
am       0
gear     0
carb     0
dtype: int64

In [117]:
data.describe()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [ ]:
# pd.read_excel('.xlsx')